/**
 * @type {Object.<string, Array<{
 *              name: string,
 *              description: string,
 *              usage: string,
 *              parameters: ? Array<{
 *                      name: string,
 *                      description: string
 *              }>,
 *              examples: Array<string>,
 *              response: string,
 *              notes: ? Array<string>
 * }>>}
 */
const AllCommands = {
    "iw": [
        {
            "name": "!פינג",
            "description": "בדוק אם הבוט עובד",
            "usage": "!פינג",
            "examples": [
                "!פינג"
            ],
            "response": "הבוט ישיב עם הודעת \"פונג\".",
        },
        {
            "name": "!סטיקר",
            "description": "שלח לי תמונה/סרטון בתוספת הפקודה, או ללא מדיה ואני אהפוך את המילים שלך לסטיקר",
            "usage": "!סטיקר [פרמטר | מילים]",
            "parameters": [
                {
                    "name": "פרמטר",
                    "description": "מלא \\ חתוך \\ עגול \\ מעוגל"
                }
            ],
            "examples": [
                "!סטיקר [פרמטר | מילים]",
                "!סטיקר עגול"
            ],
            "response": "אם קיימת מדיה בהודעה הנוכחית או המצוטטת - ישלח סטיקר מהמדיה לפי הפרמטר,\nאחרת הבוט ייצור סטיקר מהמילים לאחר הפקודה.",
            "notes": [
                "אם לא צויין פרמטר בעת שליחת מדיה - יוכנס \"מלא\" כברירת מחדל"
            ]
        },
        {
            "name": "!יוטיוב",
            "description": "שלח לי קישור לשיר ביוטיוב ואני אשלח לך אותו לכאן",
            "usage": "!יוטיוב [פרמטר]",
            "parameters": [
                {
                    "name": "פרמטר",
                    "description": "קישור לסרטון ביוטיוב או טקסט לחיפוש"
                }
            ],
            "examples": [
                "!יוטיוב [פרמטר]",
                "!יוטיוב http"
            ],
            "response": "לאחר עיבוד, הבוט ישלח את קובץ השמע של הסרטון.",
            "notes": [
                "פקודה זו נועדה להורדת שירים בלבד! נא לא לשלוח סרטונים ארוכים",
                "קיימת הגבלה של 10 דקות לסרטון"
            ]
        },
        {
            "name": "!ברקוני",
            "description": "קבל סטיקר רנדומלי מברקוני",
            "usage": "!ברקוני",
            "examples": [
                "!ברקוני"
            ],
            "response": "הבוט ישיב עם סטיקר רנדומלי של ברקוני.",
            "notes": [
                "יש לכם סטיקרים של ברקוני שלא נמצאים בבוט? מוזמנים לשלוח"
            ]
        },
        {
            "name": "!השתק",
            "description": "השתק את הקבוצה לפי זמן מסוים",
            "usage": "!השתק [פרמטר]",
            "parameters": [
                {
                    "name": "פרמטר",
                    "description": "מספר הדקות להשתקה"
                }
            ],
            "examples": [
                "!השתק [פרמטר]",
                "!השתק 5"
            ],
            "response": "כאשר מנהל שולח את הפקודה - הקבוצה תושתק מיד, אחרת - תישלח הצבעה שלאחר כמות ההצבעות מסויימת תבוצע ההשתקה",
            "notes": [
                "המספר חייב להיות בין 1 ל60.",
                "ניתן להגדיר את כמות ההצבעות על ידי פקודת \"!הגדר\"."
            ]
        },
        {
            "name": "!בטלהשתקה",
            "description": "בטל השתקה של הקבוצה",
            "usage": "!בטלהשתקה",
            "examples": [
                "!בטלהשתקה"
            ],
            "response": "פתיחת הקבוצה לדיבורים.",
            "notes": [
                "הפקודה זמינה למנהלים בלבד."
            ]
        },
        {
            "name": "!כולם",
            "description": "תייג את כל המשתמשים בקבוצה",
            "usage": "!כולם",
            "examples": [
                "!כולם"
            ],
            "response": "הבוט יתייג את כל המשתמשים בקבוצה.",
            "notes": [
                "הפקודה זמינה למנהלים בלבד."
            ]
        },
        {
            "name": "!גוגל",
            "description": "קבל קישור לחיפוש בגוגל לטקסט בהודעה המצוטטת או לטקסט לאחר הפקודה",
            "usage": "!גוגל [פרמטר]",
            "parameters": [
                {
                    "name": "פרמטר",
                    "description": "טקסט חיפוש בגוגל"
                }
            ],
            "examples": [
                "!גוגל [פרמטר]",
                "!גוגל "
            ],
            "response": "כאשר מצטטים הודעה - טקסט החיפוש יהיה של ההודעה המצוטטת, אחרת טקסט החיפוש יהיה הטקסט לאחר הפקודה.",
            "notes": [
                "כאשר לא נשלח אף טקסט לחיפוש - יישלח קישור כללי."
            ]
        }
        // {
        //   "name": "!פקודה_נוספת",
        //   "description": "פקודה זו מאפשרת למשתמשים לבצע פעולה נוספת באמצעות בוט WhatsApp.",
        //   "usage": "!פקודה_נוספת [פרמטר]",
        //   "parameters": [
        //     {
        //       "name": "פרמטר",
        //       "description": "זהו הפרמטר לפקודה וצריך להיות מסוג מחרוזת."
        //     }
        //   ],
        //   "examples": [
        //     "!פקודה_נוספת \"שלום\"",
        //     "!פקודה_נוספת \"בוט OpenAI\""
        //   ],
        //   "response": "הבוט ישיב עם הודעת תוצאה לאחר ביצוע הפעולה עם הפרמטר שסופק.",
        //   "notes": [
        //     "ודא כי אתה מקיף את ערך הפרמטר בגרשיים אם הוא מכיל רווחים או תווים מיוחדים.",
        //     "הפקודה תלויה ברישיון."
        //   ]
        //},


    ],
    "en": [
        {
            "name": "!ping",
            "description": "Ping the bot",
            "usage": "!ping",
            "examples": [
                "!ping"
            ],
            "response": "The bot will respond with \"pong\".",
        },
    ]
}

// Used in HTML page
const keyNotes = {
    "iw": {
        "notes": "הערות",
        "parameters": "פרמטרים",
        "examples": "דוגמאות",
        "response": "תגובה",
        "usage": "שימוש"
    },
    "en": {
        "notes": "Notes",
        "parameters": "Parameters",
        "examples": "Examples",
        "response": "Response",
        "usage": "Usage"
    }
}
